[{
	"Name": "Baar_Baar_Dekho",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers."
	}, {
		"Author": "Anupama Chopra Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}, {
	"Name": "XYZ",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain. It takes us a while to fall into a rhythm and pattern, as Sidharth Malhotra s character of the Maths teachers hurls from one age - span into another in pursuit of the unforgivable lapses that could ruin anyone s life.Just imagine:you fail to show upfor your wife 's painting exhibition and she falls in love with her arts dealer. Or you may not cuddle your little daughter when she asks you to do so, and this may cause indelible damage to your domesticity.Exceptionally,Baar Baar Dekho trusts silences to the talking.There are long passages without background music to over - punctuate the drama of disintegration that the couple plays out.The emotions the couple exchange seem relevant and real,as the dialogues(by Anvita Dutt) rip off pages from contemporary marriages all over the world without creating a cut - and - paste haste in the conversations.There is plenty of the rare quality of gravitas tucked away in the mischievous love tale,none more mischievous than the pundit(played with able astuteness by Rajit Kapur) who is supposed to solemnise Jai and Diya 's wedding. Jai thinks the pundit is responsible for his rushed futuristic time travel. But is he? Is this ability to stare your mistakes in their eyes a quirk of fate? Or is it something else?Baar Baar Dekho doesn 't seek or give us substantiated answers on cosmic mysteries. Why Man does what he does, who is responsible for our actions -- sometimes horribly wrong - we dont know.Neither does the film.Director Nitya Mehra glides with a silent giggle and a sigh across a beautifully painted skyline of wistful thinking.There is plenty to celebrate in Baar Baar Dekho,not the least of its virtues being the ability to deliver marital home truths without sermons or soliloquies.As the film 's main premise suggests, the success of a relationship is in the smaller details. Likewise, this film. It strings together scenes from a situation of marital calamity with an easygoing swagger that Ingmar Bergman would have found distracting.The actors have given their heart and soul to the main parts.And some of the supporting cast - not all,I am afraid - is also exceptional.But the real hero of the film is Ravi K Chandran 's camerawork. The magician that he is, Chandran imbues every frame with warmth charm and beauty. Sequences recreating Cambridge University (where a Ramanujan-like professor mentors Jai) reminded me of that very fine Ramanujan biopic The Man Who Knew Infinity.The futuristic styling is apt without getting outlandish.Come to think of it - there is nothing over - the - top in this quietly accomplished film except the Kala Chashma song and dance.Why on earth was it used to promote the film ? That zingy cheesy aura of that song is so not the film.Baar Baar Dekho is about getting a chance of changing the mistakes in life without making them.But really,I can t think of one thing Id like to see changed in this film.Except maybe Sarika s prosthetics when she plays dead. Someone overdid the mothers wrinkles."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers. The opening credits — showing the birth and growing up of the lead pair — has more romance packed in it than the entire film itself.There are no standout performances, no scenes that can pack in an emotional wallop and the conversational dialogue turns banal beyond a point. Kaif very consciously focuses on making the audience concentrate on her impossibly well-toned midriff. But she displays no such commitment and motivation towards acting, goes ahead and botches up the emotional scenes and gets way too shrill and hysterical for comfort. In the midst of all this, it gets relatively easy for Malhotra to make his presence felt. However, just as it is way too hard to believe a passionless Kaif to be a painter of modern art, it is impossible to think of Sidharth as a mathematician.The film makes a case for emotions over mathematical equations, problem solving and logic and yet doffs its hat to Vedic mathematics. That is, how it helps in figuring space travel and how all the problems of today can be solved with the help of ancient Indian sciences. Add to that, a holy thread and panditji that fill in for a time machine. If in K3G the Britishers were made to sing the national anthem we have one of them recite the Hanuman Chalisa here.Who says our popular cinema doesn’t know how to keep in tune with the changing times and the regimes?"
	}, {
		"Author": "Anupama Chopra Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}, {
	"Name": "TANGO",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain. It takes us a while to fall into a rhythm and pattern, as Sidharth Malhotra s character of the Maths teachers hurls from one age - span into another in pursuit of the unforgivable lapses that could ruin anyone s life.Just imagine:you fail to show upfor your wife 's painting exhibition and she falls in love with her arts dealer. Or you may not cuddle your little daughter when she asks you to do so, and this may cause indelible damage to your domesticity.Exceptionally,Baar Baar Dekho trusts silences to the talking.There are long passages without background music to over - punctuate the drama of disintegration that the couple plays out.The emotions the couple exchange seem relevant and real,as the dialogues(by Anvita Dutt) rip off pages from contemporary marriages all over the world without creating a cut - and - paste haste in the conversations.There is plenty of the rare quality of gravitas tucked away in the mischievous love tale,none more mischievous than the pundit(played with able astuteness by Rajit Kapur) who is supposed to solemnise Jai and Diya 's wedding. Jai thinks the pundit is responsible for his rushed futuristic time travel. But is he? Is this ability to stare your mistakes in their eyes a quirk of fate? Or is it something else?Baar Baar Dekho doesn 't seek or give us substantiated answers on cosmic mysteries. Why Man does what he does, who is responsible for our actions -- sometimes horribly wrong - we dont know.Neither does the film.Director Nitya Mehra glides with a silent giggle and a sigh across a beautifully painted skyline of wistful thinking.There is plenty to celebrate in Baar Baar Dekho,not the least of its virtues being the ability to deliver marital home truths without sermons or soliloquies.As the film 's main premise suggests, the success of a relationship is in the smaller details. Likewise, this film. It strings together scenes from a situation of marital calamity with an easygoing swagger that Ingmar Bergman would have found distracting.The actors have given their heart and soul to the main parts.And some of the supporting cast - not all,I am afraid - is also exceptional.But the real hero of the film is Ravi K Chandran 's camerawork. The magician that he is, Chandran imbues every frame with warmth charm and beauty. Sequences recreating Cambridge University (where a Ramanujan-like professor mentors Jai) reminded me of that very fine Ramanujan biopic The Man Who Knew Infinity.The futuristic styling is apt without getting outlandish.Come to think of it - there is nothing over - the - top in this quietly accomplished film except the Kala Chashma song and dance.Why on earth was it used to promote the film ? That zingy cheesy aura of that song is so not the film.Baar Baar Dekho is about getting a chance of changing the mistakes in life without making them.But really,I can t think of one thing Id like to see changed in this film.Except maybe Sarika s prosthetics when she plays dead. Someone overdid the mothers wrinkles."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers. The opening credits — showing the birth and growing up of the lead pair — has more romance packed in it than the entire film itself.There are no standout performances, no scenes that can pack in an emotional wallop and the conversational dialogue turns banal beyond a point. Kaif very consciously focuses on making the audience concentrate on her impossibly well-toned midriff. But she displays no such commitment and motivation towards acting, goes ahead and botches up the emotional scenes and gets way too shrill and hysterical for comfort. In the midst of all this, it gets relatively easy for Malhotra to make his presence felt. However, just as it is way too hard to believe a passionless Kaif to be a painter of modern art, it is impossible to think of Sidharth as a mathematician.The film makes a case for emotions over mathematical equations, problem solving and logic and yet doffs its hat to Vedic mathematics. That is, how it helps in figuring space travel and how all the problems of today can be solved with the help of ancient Indian sciences. Add to that, a holy thread and panditji that fill in for a time machine. If in K3G the Britishers were made to sing the national anthem we have one of them recite the Hanuman Chalisa here.Who says our popular cinema doesn’t know how to keep in tune with the changing times and the regimes?"
	}, {
		"Author": "Anupama Chopra Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}, {
	"Name": "XMAN",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain. It takes us a while to fall into a rhythm and pattern, as Sidharth Malhotra s character of the Maths teachers hurls from one age - span into another in pursuit of the unforgivable lapses that could ruin anyone s life.Just imagine:you fail to show upfor your wife 's painting exhibition and she falls in love with her arts dealer. Or you may not cuddle your little daughter when she asks you to do so, and this may cause indelible damage to your domesticity.Exceptionally,Baar Baar Dekho trusts silences to the talking.There are long passages without background music to over - punctuate the drama of disintegration that the couple plays out.The emotions the couple exchange seem relevant and real,as the dialogues(by Anvita Dutt) rip off pages from contemporary marriages all over the world without creating a cut - and - paste haste in the conversations.There is plenty of the rare quality of gravitas tucked away in the mischievous love tale,none more mischievous than the pundit(played with able astuteness by Rajit Kapur) who is supposed to solemnise Jai and Diya 's wedding. Jai thinks the pundit is responsible for his rushed futuristic time travel. But is he? Is this ability to stare your mistakes in their eyes a quirk of fate? Or is it something else?Baar Baar Dekho doesn 't seek or give us substantiated answers on cosmic mysteries. Why Man does what he does, who is responsible for our actions -- sometimes horribly wrong - we dont know.Neither does the film.Director Nitya Mehra glides with a silent giggle and a sigh across a beautifully painted skyline of wistful thinking.There is plenty to celebrate in Baar Baar Dekho,not the least of its virtues being the ability to deliver marital home truths without sermons or soliloquies.As the film 's main premise suggests, the success of a relationship is in the smaller details. Likewise, this film. It strings together scenes from a situation of marital calamity with an easygoing swagger that Ingmar Bergman would have found distracting.The actors have given their heart and soul to the main parts.And some of the supporting cast - not all,I am afraid - is also exceptional.But the real hero of the film is Ravi K Chandran 's camerawork. The magician that he is, Chandran imbues every frame with warmth charm and beauty. Sequences recreating Cambridge University (where a Ramanujan-like professor mentors Jai) reminded me of that very fine Ramanujan biopic The Man Who Knew Infinity.The futuristic styling is apt without getting outlandish.Come to think of it - there is nothing over - the - top in this quietly accomplished film except the Kala Chashma song and dance.Why on earth was it used to promote the film ? That zingy cheesy aura of that song is so not the film.Baar Baar Dekho is about getting a chance of changing the mistakes in life without making them.But really,I can t think of one thing Id like to see changed in this film.Except maybe Sarika s prosthetics when she plays dead. Someone overdid the mothers wrinkles."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers. The opening credits — showing the birth and growing up of the lead pair — has more romance packed in it than the entire film itself.There are no standout performances, no scenes that can pack in an emotional wallop and the conversational dialogue turns banal beyond a point. Kaif very consciously focuses on making the audience concentrate on her impossibly well-toned midriff. But she displays no such commitment and motivation towards acting, goes ahead and botches up the emotional scenes and gets way too shrill and hysterical for comfort. In the midst of all this, it gets relatively easy for Malhotra to make his presence felt. However, just as it is way too hard to believe a passionless Kaif to be a painter of modern art, it is impossible to think of Sidharth as a mathematician.The film makes a case for emotions over mathematical equations, problem solving and logic and yet doffs its hat to Vedic mathematics. That is, how it helps in figuring space travel and how all the problems of today can be solved with the help of ancient Indian sciences. Add to that, a holy thread and panditji that fill in for a time machine. If in K3G the Britishers were made to sing the national anthem we have one of them recite the Hanuman Chalisa here.Who says our popular cinema doesn’t know how to keep in tune with the changing times and the regimes?"
	}, {
		"Author": "Anupama Chopra Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}, {
	"Name": "TIME",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain. It takes us a while to fall into a rhythm and pattern, as Sidharth Malhotra s character of the Maths teachers hurls from one age - span into another in pursuit of the unforgivable lapses that could ruin anyone s life.Just imagine:you fail to show upfor your wife 's painting exhibition and she falls in love with her arts dealer. Or you may not cuddle your little daughter when she asks you to do so, and this may cause indelible damage to your domesticity.Exceptionally,Baar Baar Dekho trusts silences to the talking.There are long passages without background music to over - punctuate the drama of disintegration that the couple plays out.The emotions the couple exchange seem relevant and real,as the dialogues(by Anvita Dutt) rip off pages from contemporary marriages all over the world without creating a cut - and - paste haste in the conversations.There is plenty of the rare quality of gravitas tucked away in the mischievous love tale,none more mischievous than the pundit(played with able astuteness by Rajit Kapur) who is supposed to solemnise Jai and Diya 's wedding. Jai thinks the pundit is responsible for his rushed futuristic time travel. But is he? Is this ability to stare your mistakes in their eyes a quirk of fate? Or is it something else?Baar Baar Dekho doesn 't seek or give us substantiated answers on cosmic mysteries. Why Man does what he does, who is responsible for our actions -- sometimes horribly wrong - we dont know.Neither does the film.Director Nitya Mehra glides with a silent giggle and a sigh across a beautifully painted skyline of wistful thinking.There is plenty to celebrate in Baar Baar Dekho,not the least of its virtues being the ability to deliver marital home truths without sermons or soliloquies.As the film 's main premise suggests, the success of a relationship is in the smaller details. Likewise, this film. It strings together scenes from a situation of marital calamity with an easygoing swagger that Ingmar Bergman would have found distracting.The actors have given their heart and soul to the main parts.And some of the supporting cast - not all,I am afraid - is also exceptional.But the real hero of the film is Ravi K Chandran 's camerawork. The magician that he is, Chandran imbues every frame with warmth charm and beauty. Sequences recreating Cambridge University (where a Ramanujan-like professor mentors Jai) reminded me of that very fine Ramanujan biopic The Man Who Knew Infinity.The futuristic styling is apt without getting outlandish.Come to think of it - there is nothing over - the - top in this quietly accomplished film except the Kala Chashma song and dance.Why on earth was it used to promote the film ? That zingy cheesy aura of that song is so not the film.Baar Baar Dekho is about getting a chance of changing the mistakes in life without making them.But really,I can t think of one thing Id like to see changed in this film.Except maybe Sarika s prosthetics when she plays dead. Someone overdid the mothers wrinkles."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers. The opening credits — showing the birth and growing up of the lead pair — has more romance packed in it than the entire film itself.There are no standout performances, no scenes that can pack in an emotional wallop and the conversational dialogue turns banal beyond a point. Kaif very consciously focuses on making the audience concentrate on her impossibly well-toned midriff. But she displays no such commitment and motivation towards acting, goes ahead and botches up the emotional scenes and gets way too shrill and hysterical for comfort. In the midst of all this, it gets relatively easy for Malhotra to make his presence felt. However, just as it is way too hard to believe a passionless Kaif to be a painter of modern art, it is impossible to think of Sidharth as a mathematician.The film makes a case for emotions over mathematical equations, problem solving and logic and yet doffs its hat to Vedic mathematics. That is, how it helps in figuring space travel and how all the problems of today can be solved with the help of ancient Indian sciences. Add to that, a holy thread and panditji that fill in for a time machine. If in K3G the Britishers were made to sing the national anthem we have one of them recite the Hanuman Chalisa here.Who says our popular cinema doesn’t know how to keep in tune with the changing times and the regimes?"
	}, {
		"Author": "Anupama Chopra Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}]