[{
	"Name": "Baar Baar Dekho",
	"Data": [{
		"Author": "NDTV",
		"Review": "What if we get the chance to rectify all the big mistakes of our life? And what if a magical wand takes us into the future to personally witness all those critical twists and turns on the road journey of life where we may swerve into the wrong lane? And then, what if we get a chance to revise our actions and deeds accordingly?  Debutant director Nitya Mehra s Baar Baar Dekho is unlike any romantic yarn - I hesitate from giving it that loosely-used term the 'rom - com . It is the ultimate what-if saga, narrated with a tender care and subdued splendour that makes every moment between the lead pair precious and gladdening.Watching the film,we are just happy to see Jai and Diya together.It could be because they are played by two of the best - looking stars in our cinema.Sidharth Malhotra and Katrina Kaif look so made-for-each-other that it seems absurd to even suggest that they can be separated by destiny or design - or in thiscase by designed destiny.But human nature is such - and this is the sach(truth) that this unusually conceptualized film dwells on with mollifying magnificence--that it sinks the very ship that keeps hope afloat.With believable nearsightedness--don t we all mess up in life? - Jai tells Diya on the day of their wedding that he would rather not marry her and instead pursue his dreams of going to Cambridge.The hurt,humiliation,bewilderment and disappointment that Katrina Kaif shows on screen in her sequence of painful rejection dashing hopes of shared lifetime,is a joy to behold.This is the first occasion in her career when Katrina Kaif has actually sunk her ego into her character.You can see her feeling the hurt and the happiness with equal sincerity.Bravo!Sidharth Malhotra,so far seen giving performances where his matinee - idol looks obfuscate his other purported virtues,comes into his own with a character who is clueless about the stunning time travel that fate / destiny / karma / kundli puts him through.It s a morality fable bolstered by bouts of effervescence, nostalgia regret and pain. It takes us a while to fall into a rhythm and pattern, as Sidharth Malhotra s character of the Maths teachers hurls from one age - span into another in pursuit of the unforgivable lapses that could ruin anyone s life.Just imagine:you fail to show upfor your wife 's painting exhibition and she falls in love with her arts dealer. Or you may not cuddle your little daughter when she asks you to do so, and this may cause indelible damage to your domesticity.Exceptionally,Baar Baar Dekho trusts silences to the talking.There are long passages without background music to over - punctuate the drama of disintegration that the couple plays out.The emotions the couple exchange seem relevant and real,as the dialogues(by Anvita Dutt) rip off pages from contemporary marriages all over the world without creating a cut - and - paste haste in the conversations.There is plenty of the rare quality of gravitas tucked away in the mischievous love tale,none more mischievous than the pundit(played with able astuteness by Rajit Kapur) who is supposed to solemnise Jai and Diya 's wedding. Jai thinks the pundit is responsible for his rushed futuristic time travel. But is he? Is this ability to stare your mistakes in their eyes a quirk of fate? Or is it something else?Baar Baar Dekho doesn 't seek or give us substantiated answers on cosmic mysteries. Why Man does what he does, who is responsible for our actions -- sometimes horribly wrong - we dont know.Neither does the film.Director Nitya Mehra glides with a silent giggle and a sigh across a beautifully painted skyline of wistful thinking.There is plenty to celebrate in Baar Baar Dekho,not the least of its virtues being the ability to deliver marital home truths without sermons or soliloquies.As the film 's main premise suggests, the success of a relationship is in the smaller details. Likewise, this film. It strings together scenes from a situation of marital calamity with an easygoing swagger that Ingmar Bergman would have found distracting.The actors have given their heart and soul to the main parts.And some of the supporting cast - not all,I am afraid - is also exceptional.But the real hero of the film is Ravi K Chandran 's camerawork. The magician that he is, Chandran imbues every frame with warmth charm and beauty. Sequences recreating Cambridge University (where a Ramanujan-like professor mentors Jai) reminded me of that very fine Ramanujan biopic The Man Who Knew Infinity.The futuristic styling is apt without getting outlandish.Come to think of it - there is nothing over - the - top in this quietly accomplished film except the Kala Chashma song and dance.Why on earth was it used to promote the film ? That zingy cheesy aura of that song is so not the film.Baar Baar Dekho is about getting a chance of changing the mistakes in life without making them.But really,I can t think of one thing Id like to see changed in this film.Except maybe Sarika s prosthetics when she plays dead. Someone overdid the mothers wrinkles."
	}, {
		"Author": "The Hindu",
		"Review": "Just like perennially happy people, there is something about totally sorted individuals that makes one very wary of them. These are people who seem to have figured out not just themselves, but their relationships, life, future, everything; who are seemingly content with what life has to offer and comfortable with the regular and the accepted. Then there are the eternally restless souls — constantly questioning, eternally claustrophobic, wanting desperately to break free, at times even from themselves.Of late, a clutch of Hindi films has been playing on these binaries and eventually making the one at a tangent fall in line. Nitya Mehra’s Baar Baar Dekho is the latest in that list. Only it moves a level up from the theme of recklessness and commitment phobia in films like Wake Up Sid and Yeh Jawani Hai Deewani to have its protagonist smacked into accepting the importance of family over professorship at Harvard and Cambridge. It’s all about making him learn to love his family than mathematics.If it’s a Dharma and Excel combine then the film doesn’t just have to be about looking good, but doubly so. However, the fetching frames, the element of time travel, futuristic mobiles, homes, cars and gadgetry and the advanced prosthetics and makeup can’t quite take away from the familiar, time-worn take on relationships. So we have a maths genius, Jai Verma (Sidharth Malhotra) travel ahead (10 days, two years, 16 and then 30 years) and later a bit back in time to get a second chance at mending his marriage with Diya Kapoor, aka DK (Katrina Kaif) and learning that it’s the small moments together that count more than his own big ambitions. Though to be fair to him not once in the unconvincing film does he come across as the one neglecting his relationship and family. That is, unless wearing a T-Shirt emblazoned with “Roamers and Seekers” and surfing a website called totallyimmersed.com is enough to stamp him as selfish. In fact, my heart reached out to him when, on the eve of his wedding, he asks the domineering DK if he doesn’t even have the right to think for himself.The film is structured around small vignettes, or, as Jai himself puts it, the highlights of his life — wedding, honeymoon, children and more. There are no layers to the characters, no complexity to the warp and weft of urban relationships. So the parents, siblings, friends and progenies are more like frame fillers and props rather than full blown people. The couple itself is cardboard flat and dull. Neither do the two reach out to each other on screen nor does their love work any magic on the viewers. The opening credits — showing the birth and growing up of the lead pair — has more romance packed in it than the entire film itself.There are no standout performances, no scenes that can pack in an emotional wallop and the conversational dialogue turns banal beyond a point. Kaif very consciously focuses on making the audience concentrate on her impossibly well-toned midriff. But she displays no such commitment and motivation towards acting, goes ahead and botches up the emotional scenes and gets way too shrill and hysterical for comfort. In the midst of all this, it gets relatively easy for Malhotra to make his presence felt. However, just as it is way too hard to believe a passionless Kaif to be a painter of modern art, it is impossible to think of Sidharth as a mathematician.The film makes a case for emotions over mathematical equations, problem solving and logic and yet doffs its hat to Vedic mathematics. That is, how it helps in figuring space travel and how all the problems of today can be solved with the help of ancient Indian sciences. Add to that, a holy thread and panditji that fill in for a time machine. If in K3G the Britishers were made to sing the national anthem we have one of them recite the Hanuman Chalisa here.Who says our popular cinema doesn’t know how to keep in tune with the changing times and the regimes?"
	}, {
		"Author": "Hindustan Times",
		"Review": "Baar Baar Dekho is book-ended by highlights. The film ends with Kala Chashma, that insanely infectious Badshah song. When it began, at least a few people in the theatre I was in started dancing. And Baar Baar Dekho begins with a beautifully wrought summary of a grand romance — Diya and Jai are born on different continents; their paths cross in Delhi when they are eight; they become best friends and the relationship deepens into love. All of this happens before the opening credits finish. I was instantly sold — on both, the characters and the talent of debutant director Nitya Mehra.The problem is everything in between. Baar Baar Dekho is essentially the movie equivalent of a Hallmark card. The writers — Sri Rao, Anuvab Pal and Nitya herself — are imparting life lessons here. In case you miss them, the characters helpfully spell them out. A wise pundit tells us: “Badi baaton pe nahin, chhoti baaton pe dhyan do”. And a sagely professor of mathematics declares: “Balance ke bagair koi equation perfect nahin hoti”. All working moms know this, but it takes Jai a hundred and forty-two minutes to figure it out.learns to enjoy each day of what he calls his ‘extraordinary, ordinary life’. Like that man, Jai also becomes a loving husband and father by travelling back and forth in time. He realises how empty his life will be if he continues to put his passion — Vedic mathematics — above all else.On paper, this must have seemed like an ambitious, beguiling idea, especially for Hindi cinema. On screen, it’s an absolute slog. Jai just keeps waking up in different years and has no clue what has happened in the years that have gone by.So Sidharth Malhotra is forced to keep the same dazed and confused expression on his face through the film. He’s in practically every frame. It’s a tough load to carry and he works hard to make Jai’s struggle palpable. But the screenplay doesn’t support him. To begin with, he has to convincingly play a man who is reluctant to marry Katrina Kaif — who, of course, looks smashing.Katrina also stretches herself by finding some depth and expression. But the repetition in the narrative simply flattens out their efforts. Even the most ardent Sid and Kat fans will find it difficult to stay interested.Baar Baar Dekho has been jointly produced by Excel Entertainment and Dharma Productions. These production houses are the high priests of a sub-genre that I call posh people angst — basically, stories about affluent, attractive people. The good thing about these movies is that when the story fails, you can focus on the styling. Baar Baar Dekho is impeccably good-looking. Cinematographer Ravi K Chandran gives every surface a sheen. The locations are lovely and so are the outfits. It’s also a pleasure to see strong actors like Sarika, Ram Kapoor and Rajit Kapur.But none of this is enough to sustain you through the length of this desperately flawed film. I’m going with two stars but keeping my faith in Nitya. That opening sequence holds promise of greater things."
	}]
}, {
	"Name": "Pink",
	"Data": [{
		"Author": "NDTV",
		"Review": "Pink is a contemporary youth-centric film with a strong socially relevant message about the choices young women of today make and about respecting those.Narrated in a linear manner, the simplistically presented film, essentially a courtroom drama, is powerful, owing to its missive, dialogues and performances.Three young working women, Minal (Tapasee Pannu), Falak (Kirti Kulhari) and Andrea (Andrea Tairang) are flatmates in Delhi and good friends. An untoward incident one night at a resort in Surajkund, involving some boys, among whom is Rajveer (Angad Bedi), who comes from a politically well-connected family, proves to be life changing for the trio.What follows is an intriguing courtroom drama where ace lawyer Deepak Sehgall represents them in a bid to get them justice.Replete with contemporary instances and issues, centering around women and their safety, the film, through its potent dialogues, takes a dig at society and its stereotypical norms and prejudices towards women, as in The Rule Book of the Girls Safety Manual, enumerated by lawyer Deepak Sehgall.Director Aniruddha Roy Chowdhury extracts natural performances from all his actors, and makes a meaningful film devoid of any unnecessary commercial trappings, never once deviating from the core theme.Amitabh Bachchan as Deepak Sehgall, the aged defence lawyer, shines as always, in a restrained, but powerful performance. His histrionics come primarily in the form of his well-modulated baritone, conveying his emotions and of course, from the well-written lines.Taapasee Pannu, as the protagonist Minal Arora plays the brave, present-day Delhi girl with convivial ease. She delivers a power-packed performance, naturally, slipping into her character bringing out the contrast as a strong yet vulnerable girl. Her anxiety, frustrations and angst, against society and the system and its hypocrisy, are all palpable.Kirti Kulhari as Falak Ali, is equally a powerhouse as a performer. She renders her character of a modern working girl annoyed with the double standards of society, in a convincing manner. The scene in the courtroom, where she breaks down, in particularly laudable.Andrea Tairang, playing the girl from the northeast is natural, and lives her character with sincerity.Piyush Mishra as Prashant, the prosecution lawyer, is brilliant, as he succeeds in the audience despising him for his scathing remarks against women and the societal norms they must conform to.Angad Bedi as Rajveer, the spoilt rich son of a politician, makes the most of his limited screen time. He is intense, becomes the character he is essaying and delivers a credible performance.The rest of the cast too, comprising the kind-hearted landlord, the lady police officer, the three friends of Rajveer, support the main actors with their strong performances.The strength of the film, apart from its great performances, are its taut screenplay and dialogues. Flavoured with a language that the youth of today will relate to, the dialogues are hard-hitting and strike a chord immediately, as they are packed with relevant messages. Humour comes in the form of the satirical dialogues, and lightens the tenor of the otherwise intense film.With moderate production values, Cinematographer Abhik Mukhopadhay's lens captures the drama in a realistic manner.The only song in the film, Kaari Kaari Raina, is used effectively to encapsulate the mood and messages in the film.Overall, Pink is an evocative film about women, brimming with messages relevant for society, and keeps you riveted to the screen"
	}, {
		"Author": "The Hindu",
		"Review": "Every once in a way you decide that enough is enough and go for a confrontation, however ugly it may be. Years ago in Delhi, as a greenhorn in journalism, I decided to take an auto driver with a faulty meter and uber-rude ways to the Lodi Road police station. I should have sensed that something was amiss when he willingly drove me there to file a complaint against him. The 10 minutes inside the station became a protracted nightmare with the cops, women included, ganging up with him against me, calling me names, playing mind games of the worst kind. I still can’t figure out how they manipulated, turned the tide against me and made me into a wrongdoer out to harm a “poor” driver. I filed the complaint but found myself stepping out, trembling in both fear and rage, knowing they would all be laughing behind my back. Who knows, the auto might have been registered under a cop’s name, said close friends.Why start a film review by narrating what is clearly a personal story? The connection lies in drawing attention to what appeals the most about Pink: its compelling portrayal of a system complicit with the influential in badgering the innocent is something we would all have seen, heard of or experienced closely at some point in time and can empathise with. Only the degree of harassment varies. It gets more skewed when a woman is at the receiving end.In Pink, the focus is on the ordeal of three single girls, Meenal Arora (Taapsee Pannu), Falak Ali (Kriti Kulhari) and Andrea (Andrea Tariang), whose night out at a rock concert sets off a terrifying chain of events. Their frightful experience gets cleverly sandwiched between the blank opening credits and the final explicatory visuals of the closing credits; it’s all about things coming a full circle for the threesome.The first half is like a thriller, taut and tense, with the audience biting its nails out of concern for the girls’ safety as Rajveer (Angad Bedi) and his set of cronies are out to make life hell for them. All for nixing his advances and resisting his attempts at molestation.Ostensibly, it might be a film about three women (the gender and happiness quotient of a Dil Chahta Hai turned on its head) but besides their fears, frustrations, anger, helplessness and vulnerability, what we see most are the men around them, and their attitude towards women. There are all kinds in their universe: from the loving, caring landlord who won’t evict them despite threats from the nosy neighbour who suspects them of prostitution; an estranged boyfriend who says he can either be truthful or liberal (never helpful) and the severely entitled, deeply patriarchal and feudal boys; a cop (much like the ones I faced) who wants to deter them from filing a complaint and the lawyer who goes to any extent, asks intrusive questions and seeks intimate details, to humiliate them to save his clients. Even the biased Haryanvi woman cop is like a toy in the hands of the powerful men.The film addresses the men and uses the figure of Deepak Sehgal (Amitabh Bachchan), a respected patriarch who doubles up as the girls’ lawyer, to reach out as the voice of reason, with the judge (Dhritimaan Chatterjee) as an ally. The girls are alright; it’s the boys who need to get their act together.The three girls make for an utterly believable slice of working women’s life in the Capital. The camaraderie and sorority between the trio is effective because the three actors play off very well against each other. But a special word for Kulhari (as Falak), who holds her own with a few remarkably-handled breakdown scenes. Efficient turns from veterans like Bachchan and Chatterjee are a given, but it’s the not-so-known faces who make an impression. Like Vijay Varma as Rajveer’s friend Ankit, who makes you loathe him for his air of masculine entitlement. Not to forget Mamta Malik as the Haryanvi cop, who gets her accent, gestures, attitude spot on. The film also uses a lot of familiar Delhiwalas in small roles: Vinod Nagpal, Sudhanva Deshpande, Dibang.You could question a lot of plot points, find the Mamta Shankar subplot entirely needless, think of the raising of the North-East issue as a bit perfunctory and patronising. The courtroom drama of the second half gets heavy-handed and is high on histrionics, with Piyush Mishra going over the top as the boys’ lawyer.Pink is a relevant film, in a day and age when there are many such cases in the news, when attempts by women at seeking justice are often equated with vindictive litigation. Despite the fact that so many women don’t even have recourse to justice, they are accused of misusing the law. And feminists are roundly dismissed as ‘feminazis’. When one article upon another on a recent case (of alleged sexual assault) has been obfuscating reason and rationality in many of us (including yours truly), it’s good to have a film stating categorically, even if a trifle simplistically, that a no is a no is a no. That single working women are not a catch. That friendly girls are not promiscuous. That a shared drink doesn’t mean a woman is available. That it all boils down to a woman’s choice and consent"
	}, {
		"Author": "Hindustan Times",
		"Review": "Two cars are moving in two different directions. Each has three passengers - the first one has girls and the second is being driven by boys. Parallel cutting suggests a connection. One of the boys is bleeding and the girls look tense. A dark and sinister night has engulfed the Delhi-NCR region and everyone’s waiting for the morning light.This is your story. Our story.Meenal Arora (Taapsee Pannu), Falak Ali (Kirti Kulhari) and Andrea Tariang (Andrea Tariang) are working women living in a posh south Delhi locality. Their daily struggle with neighbours’ questioning eyes has made them brave and ready for tougher challenges. They meet Raajveer Singh (Angad Bedi) and his friends at a rock concert which ends when Raajveer gets hit by a bottle and starts bleeding.Raajveer is rich, highly educated and well connected. He decides to seek vengeance on the girls. A war between the genders starts and the police, society, parents, judiciary and everyone else become a party.After delivering acclaimed Bengali dramas like Anuranan, Antahin and Aparajita Tumi, Aniruddha Roy Chowdhury forays into Hindi with Pink, and what a debut it is. There aren’t any of the usual jazzy Bollywood criminals here yet you feel terrified. No dramatic sounds to enhance the mood, still you want to hear it. No dim lights, but you want to look away.The reason is simple: You know this world and its inhabitants.If Kanu Behl’s Titli brought out the harsh truths of east Delhi’s lower middle class vicinity, Pink sketches a similar picture of a tony south Delhi. Unfortunately, the attitude of people inhabiting these districts is common across the country and could even be universal.Pretension, ego, sense of male superiority and skewed ideas of perfect womanhood make it complicated, intriguing, disgusting and disturbing. But, we have seen this happening around us in real life.So, it doesn’t come as a surprise when the police arrest Meenal under Section 307 IPC, attempt to murder. Who cares if she did it in self-defence! Nobody knows what happened that fateful night. Everyone’s assuming. Because the girls went with the boys and they ate and drank together, moral yardsticks have to be set. A woman investigative officer doesn’t help either. After all, she too is a part of this society.But, a well-intentioned man is yet to enter the game and could change it for the girls. Once a successful lawyer, Deepak Sehgal (Amitabh Bachchan) had to hang his boots because of a deteriorating mental condition. Sehgal returns to the courtroom for one last time.This can be surprising for people who want a woman to fight on behalf of others, but then is there really a match for that devastating baritone and intimidating eyes? Bachchan gives it all and drives his points home with such force that you fall in love with him all over again. The master’s complete dominance silences the courtroom and the audience. Don’t be amazed if you start feeling uncomfortable and break into tears and claps.Every single actor has upped the ante in this 136-minute riveting drama. If Taapsee excels in initial courtroom scenes, Kirti takes it to a whole new level in the finale. The girls have shown a tremendous range and Pink belongs to them. Nobody has overshadowed them, not even Bachchan or a shrewd lawyer Prashant, played by a super intense Piyush Mishra.Attention to details is visible in the screenplay. Scenes keep changing at a rapid pace without being preachy. Also, it’s a case which is very ordinary in nature. Hundreds of such cases are filed every day. What’s the big deal about this one?Well, that’s exactly the big deal. It can be your story. It’s about every woman living in this egoistically twisted man’s world. It’s about parents, brothers and husbands worried about their loved ones’ safety.Pink keeps us gripped from all sides even as a strictly entertainment package. The intricacies of the case unfold like a thriller. You won’t miss the usual Bollywood courtroom theatrics either. Still you will get to know a thing or two about the contemporary feminist debates."
	}]
}, {
	"Name": "Akira",
	"Data": [{
		"Author": "NDTV",
		"Review": "Director AR Murugadoss third film after Ghajini and Holiday is an attempt to establish Akira as the new Shiva, the excellent student protagonist in Ram Gopal Varma’s 1989 film. But a lousy script, tedious length and over the top acting restrict it from becoming even a patch on it.Akira Sharma (Sonakshi Sinha), explained as gracefully strong, chooses martial arts over dancing when she is 11 years old after realising the value of physical power. A local hero in Jodhpur, Akira decides to come to the big bad world of Mumbai for higher education.Thanks to her habit of standing up to the authorities, she becomes one of the most talked about students in her college.On the other side of the fence, a group of weed smoking cops are taking the law for a ride.They cross paths and Akira unwittingly lands up in a vicious net of deceit, crime and betrayal.Will she punch her way out of this trap?When a wide-eyed ACP Govind Rane (Anurag Kashyap) informs us about his weed, ‘South ka maal hai, achcha hoga’ (This stuff is from South, must be good), we take it as a compliment about Murugadoss’ filmography. He scares a college professor, subordinates, pavement dwellers, students, a dubious woman, two of her allies - basically anyone who comes within his sight.He is up against a woman of substance, but the weak build-up cools off the heat. Maintaining the tradition of popular South Indian action films, Murugadoss relies on one-liners and the populist behaviour of its characters. Lacking any novelty in the story, he ends up putting Sonakshi Sinha in the situations faced by her male counterparts in countless number of films.Projected as a woman’s fight against injustice, Akira has many loose threads. Characters keep appearing and disappearing without any justification, and that’s probably not a good thing to happen in a 138-minute film.The scenes keep changing without establishing anything. The audience is taken from the college dungeons to the headmaster’s house to mental asylums in search of a clue, but they don’t get any.Akira isn’t an out and out action film. In fact, the makers are too concerned about making it look like a family drama. Lacklustre supporting cast and depthless writing make it even duller.Despite some shots of acid attack survivors and specially-abled children, Akira fails to evoke any solid emotion.Sonakshi Sinha is an eye-catching action star and director-turned-actor Anurag Kashyap evil incarnate in A R Murugadoss' intriguingly titled Akira. Both pull off their roles with astonishing aplomb.The film as a whole is, however, patchy. Its facile genre sleights - rogue cops, wronged innocents and bloody confrontations - hit home only sporadically. Despite pitchforking a kickass female protagonist into the spotlight, and also writing an upright cop role for an actress (Konkona Sen Sharma), Akira does not seem as radical a commercial Hindi film as one might expect it to be.Hindi movie fans have seen action dramas aplenty about the police-underworld nexus. In Akira, a cynical segment of the police force is itself the underworld. But, for all its aggressive shots at trying to be different, the film plays out as no more than a crime drama in which an aggrieved protagonist fights tooth and nail against forces that might get away with murder if the former does not intervene. There is obviously no suggestion in the screenplay that the heroine's deaf-mute father (Atul Kulkarni in a special appearance) was ever a Kurosawa fan.Nor does the director's approach to the supercharged crime drama reveal any stylistic traits that might please those that have been weaned on the Japanese cinema legend's timeless masterpieces. To put all speculation at rest, the film informs the audience right at the outset that Akira is a Sanskrit world that means graceful strength. It then proceeds to spell out exactly who embodies it. The heroine of the film is Akira Sharma (Sonakshi Sinha), a college student who is sucked into a violent conflict with four Mumbai policemen spearheaded by a vicious, cocaine-snorting assistant commissioner of police, Govind Rane (Anurag Kashyap).The latter have a lot to hide and they suspect that Akira is a woman who knows too much for their good.The four policemen put everything at stake to ensure that the girl isn't able to blow the lid off a crime that they committed in broad daylight. Akira, a loose reworking of the 2011 Tamil hit Mouna Guru - the story is credited to Santha Kumar, the director of the original film - opens with a police van zipping down a desolate highway.The vehicle stops off a clearing in the forest, and three youngsters, two boys and a girl, their hands tied behind their backs, are lined up like sitting ducks before a policeman's gun. One of the boys is shot dead.The film cuts to 14 years earlier to reveal flashes of the childhood of the girl whose life is on the line. As a schoolgirl in Jodhpur, Rajasthan, Akira identifies an acid attack perpetrator. Sometime later, her mastery over martial arts comes in handy. She not only thwarts an eve teaser, she accidentally disfigures his face with the very acid that he tries to hurl at her. Akira is taken away to a remand home for children. Misfortune follows her even after the move to Mumbai, where she runs into a snarky sister-in-law, a bully at the college and, of course, the quartet of cops who want to eliminate her.They succeed in packing her off to a mental asylum where the presiding psychiatrist declares her insane. But Akira is obviously no pushover. The film is replete with action sequences in which the heroine has a go at groups of men double her size and comes up trumps.Several women, including the ACP's mistress, are subjected to extreme indignity and violence in the course of the film. So, Akira also has a heavily pregnant policewoman Rabiya Sultan (Konkona Sen Sharma), who steadfastly follows the leads that could bring the wrongdoers to book.While she treads the path of law, Akira is left to resort to her own rough and ready methods in the fight for justice.It is all rather contrived. Akira is a natural do-gooder who happily lends a helping hand to those that need it.In one scene, she is invited by the college principal to deliver a speech. A group of trouble-makers among the students mess up the sound system. Undeterred, Akira alights from the stage and addresses a group of deaf-mute school students with the help of sign language.Akira is no breakthrough for women power in Hindi cinema. The heroine is actually only a female version of the swaggering supermen played on the big screen by the likes of Salman Khan and Akshay Kumar. She might be far daintier and slighter built, but there is absolutely nothing that is beyond her. She suffers a lot on account of her courage, but her invincibility is never in doubt. And that robs the film of any real possibility of springing any real surprises.The film certainly has its moments, and Sonakshi does her career no harm by revealing a new facet of herself, but Akira isn't blockbuster material. "
	}, {
		"Author": "The Hindu",
		"Review": "There has been an eternal problem with many a Hindi action film with the woman at the centre. Even as these flicks claim to break the gender stereotypes—turn coy heroines into tough heroes—they actually don’t. Add A.R. Murugadoss’s Akira to that rather long list of films in which the woman pretends to, but never quite kicks serious butt, where being strong essentially means having to suffer and sacrifice.And so we have Akira (Sonakshi Sinha) who is trained by her dad in karate than kathak, who teaches a lesson or two to the roadside goons back home in Jodhpur and ends up in the remand home for it. Trouble seems to follow her even as she carries on being a good girl. A shift to Mumbai finds her daggers drawn with college ruffians and a corrupt cop Govind Rane (Anurag Kashyap) who plays the game of “almost running over the pavement dwellers” with his official vehicle, slaps a college professor and makes the students take to the streets and face tear gas and rifles (all this while I kept wondering when was the last time Mumbai college-goers ever protested with such show of strength). He also has no compunctions to murder for money.Sinha is slim, svelte and agile and wears a constant sulk for expression. Kashyap seems to be having all the fun while being resolutely himself. When he puffs at the joint and says, “Maal achcha tha, South se hoga”, it almost felt like he was endorsing Tamil cinema, as he always does. None of the actors gets any support from the script. The plot is utterly long-winded and tortuous with plotholes and weird coincidences strewn all over. But ours is not to question why. So in the most random and bizarre turn of events Akira finds herself in a mental asylum. If Salman Khan can in Tere Naam, why can’t she? It's done most easily with nary a protest from even her close family members. There is an overt attempt at ticking a few right boxes—a split second nod to the cause of acid attack victims, pitting a heavily pregnant (Kahaani inspired) but competent lady cop Rabia (an utterly disinterested Konkana Sen Sharma) as against the corrupt male cops. But the entrenched patriarchy and misogyny is not shaken off, rather it gets reiterated with the many mixed metaphors. There is constant righteous harping on the virtues of the woman. She is pounded to pulp, made to suffer most gratuitously before she can rise up and pound back like a possessed avenging angel. It is the familiar falling back on the Durga-Shakti-Kali sterotype.And in the most ridiculous and bizarre turn of the plot towards the end Akira has to become the sacrificial goat for the larger good of the community—“in the national interest”, “for the sake of law and order”, “to save the town from possible communal unrest”. Never has any actor looked as unconvinced mouthing such inanities as Sharma to Sinha. Meanwhile, Sinha gamely sees herself as a Christ figure who bears the sins of the world on the cross. Daughter India replaces Mother India. And all I could say to myself at the end of the film was Beti Bachao."
	}, {
		"Author": "Hindustan Times",
		"Review": "Director AR Murugadoss’ third film after Ghajini and Holiday is an attempt to establish Akira as the new Shiva, the excellent student protagonist in Ram Gopal Varma’s 1989 film. But a lousy script, tedious length and over the top acting restrict it from becoming even a patch on it.Akira Sharma (Sonakshi Sinha), explained as gracefully strong, chooses martial arts over dancing when she is 11 years old after realising the value of physical power. A local hero in Jodhpur, Akira decides to come to the big bad world of Mumbai for higher education.Thanks to her habit of standing up to the authorities, she becomes one of the most talked about students in her college.On the other side of the fence, a group of weed smoking cops are taking the law for a ride.They cross paths and Akira unwittingly lands up in a vicious net of deceit, crime and betrayal.Will she punch her way out of this trap?When a wide-eyed ACP Govind Rane (Anurag Kashyap) informs us about his weed, ‘South ka maal hai, achcha hoga’ (This stuff is from South, must be good), we take it as a compliment about Murugadoss’ filmography. He scares a college professor, subordinates, pavement dwellers, students, a dubious woman, two of her allies - basically anyone who comes within his sight.He is up against a woman of substance, but the weak build-up cools off the heat. Maintaining the tradition of popular South Indian action films, Murugadoss relies on one-liners and the populist behaviour of its characters. Lacking any novelty in the story, he ends up putting Sonakshi Sinha in the situations faced by her male counterparts in countless number of films.Projected as a woman’s fight against injustice, Akira has many loose threads. Characters keep appearing and disappearing without any justification, and that’s probably not a good thing to happen in a 138-minute film.The scenes keep changing without establishing anything. The audience is taken from the college dungeons to the headmaster’s house to mental asylums in search of a clue, but they don’t get any.Akira isn’t an out and out action film. In fact, the makers are too concerned about making it look like a family drama. Lacklustre supporting cast and depthless writing make it even duller.Despite some shots of acid attack survivors and specially-abled children, Akira fails to evoke any solid emotion."
	}]
}, {
	"Name": "A Flying Jatt",
	"Data": [{
		"Author": "NDTV",
		"Review": "It is very hard to fathom the purpose of this aimless flight. If the idea behind A Flying Jatt is to unveil a new money-spinning franchise, we don't know about the money bit but it would be a moviegoer's worst nightmare come true. Isn't one bad enough? A few more such flicks would be cinematic hell. Poorly mounted, abysmally acted and dreadfully tedious, A Flying Jatt, directed and co-written by choreographer Remo DSouza, flies on empty.Its ideas and themes are ripped off from sundry sources and cobbled together in a scrappy, sloppy comic-strip fantasy that is about as steady as an eel on a slippery slope. A Flying Jatt is so whimsically infantile in its conception of a homegrown Superman-like crime-buster that it never gains any height. Even for those that are suckers for superhero actioners, the film lacks the punch required to pass muster. So where is this Jatt flying? Devoid of magic and mystery, the film takes all of two-and-a-half hours to deliver a grand anti-pollution message: everything has an alternative, but not Mother Earth.True, there is no alternative for good sense. When will Bollywood stop foisting such glossily-packaged garbage bags upon us? Yes, A Flying Jatt, anchored by a glassy Tiger Shroff whose acting skills are still pretty rudimentary, delivers a truckload of trash that inevitably stinks to high heaven.Flying on a wing and a prayer, this film about a young Jatt in a rut is a yawn-inducing exercise that only gets worse with every passing frame, each as fatuous as the previous one. It is a tree in the middle of a water body that triggers all the mayhem. It bears a divine sign on which much irrational mumbo-jumbo is centered. An industrialist (Kay Kay Menon) desperately needs the land in order to build a bridge to serve his polluting factory by the lake. The Patiala peg-swigging mother (Amrita Singh) of a blundering martial arts teacher Aman (Tiger Shroff), speaking for all the residents of Kartar Singh Colony, refuses to part with the patch no matter what.The angry entrepreneur unleashes a man mountain called Raka (WWE fighter Nathan Jones) to browbeat the ladys son into submission.To begin with, this lad is diffidence personified. He is afraid of heights, is bullied by his students, and is the butt of ridicule for his colleagues.His mom keeps reminding him that his dear departed father was the first sardar in history to learn kung-fu at the feet of a Shaolin master.So swift were the late patriarchs moves that the Chinese gave him the title Flying Jatt. Sounds Greek? It is. To return to the story, in a violent confrontation, as the mammas boy is pinned to the aforementioned tree by the murderous Raka and is on the brink of being reduced to pulp, providence intervenes. The young man turns into an invincible force. He can now fly and beat the shit out of wrongdoers. What's more, no bullet nor dagger can harm him anymore.Her entreaties to the Lord answered, his mother breaks into a dance of joy. Superhero ban gaya, she chants. She even stitches a garish costume for her son to go with his new-found saviour-of-the-meek status. The rest of the film is anything but super.Subjected to lightning strikes, Raka ends up in a dump of toxic industrial waste. He lies there for so long that, when he emerges from the mess, he becomes the very embodiment of all that is ugly in the air that we breathe. The mighty arch-villains blood turns black and he spews dark fumes through his mouth and nostrils. The lowbrow comic-strip spirit of A Flying Jatt extends to the films rough-hewn production design. Nothing that appears on the screen, neither the houses nor the props, looks real. The home in which the protagonist and his mom live, as well as those around it, resemble cardboard structures.The CGI-laden office of the evil industrialist looks straight out of a futuristic fantasy. Jacqueline Fernandez signals all that is wrong with this film. Playing Kirti, a schoolteacher who does anything but teach, she is the heros romantic interest and song-and-dance partner. The smitten girl act that Jacqueline is called upon to perform is hopelessly over the top, but it is well in keeping with the rest of the film, which, as it title warns, never has its feet on the ground.In a prelude to a musical set piece, the superhero asks his besotted lady love: Do you trust me? She nods. And, lo and behold, he picks her up and takes her on a ride through nothingness, singing and dancing in mid-air. Elsewhere in A Flying Jatt, the thwarted and frustrated entrepreneur demands to know from his hatchet man where he should funnel the effluents that his factory produces. Where, he thunders, do I dump my waste?"
	}, {
		"Author": "The Hindu",
		"Review": "In a tangential way, A Flying Jatt reminded me of a few portions I have seen of Malegaon Ka Superman, an ultra low-budget spoof film by Shaikh Nasir, the leading filmmaker of the town. The villain there loved “gandagi” (filth) in much the same way as the villain here thrives on pollution. The early parts of A Flying Jatt have a similar touch of the burlesque as Nasir’s video film, especially how the superhero (Tiger Shroff) himself is mocked time and again. So much so that someone even calls him a joker. He is scared of heights so he flies low. Much to his consternation, his pushy mother (Amrita Singh) keeps making him try out weird costumes, insists he should fly out of the window than leave home through the door. She is terribly critical of his landings and even uses his superpowers to clean up the cobwebs high up on the walls. It is in these jokey parts that the film was fun in a childish way and could elicit an indulgent chuckle out of me.But soon the jokes are sidestepped for some preaching—on religion, nation and pollution. The film stands on twin planks—Swachh Bharat Abhiyaan (no wonder CBFC chief Pahlaj Nihalani has been such a vocal supporter of the film) and Raj Karega Khalsa, the Sikh slogan of sovereignty. At one level it is an out and out propaganda vehicle for the clean India drive and at the same time an ode to Sikhs as well. There is an entire scene explaining the significance of the turban, the valour of the Sikhs (sawa lakh se ek ladaun—the age old saying has it that one sikh can alone take on 1.25 lakh) and how the sardars have been needlessly ridiculed.And so we have the hero, Aman, who is a cut-surd (as we say in the Delhi parlance), i.e. a Sikh who has cut his hair. He is a martial arts teacher who stays with his mother in this peaceful, unpolluted enclave by a huge old tree. Businessman Malhotra (Kay Kay Menon) wants to grab the land and employs a lethal foreign gunda called Raaka (Nathan Jones) to bring the big tree down. That’s when the tree decides to transmit its supernatural powers through the Khalsa symbol to Aman and soon he takes on Raaka, Malhotra and pollution.A clunky script, comic book flat characters and a wafer-thin plot are propped up by needless song-n-dance routines, juvenile SFX and innumerable fights and confrontations. The climactic battle in space is hilariously ridiculous, with some unnamed planet, a satellite, rocket and nuclear battery, all thrown in.There’s a scene in the film where Aman’s mother shows several foreign superhero DVDs to him to light up the spark in him. She then quietly goes on to sit at the sewing machine, just like a good old Hindi film mother would do, to stitch him a Khalsa warrior inspired costume for him. It’s these gawky, desi touches that actually work way better for the film than the obvious nods to the Hollywood superhero genre.Shroff is light and lithe with dance, action and mild comedy (a highlight is a ‘Baby Doll’ hat tip to Sunny Leone) but hasn’t still been able to find a right balance when it comes to emotions—he either overacts (notice him in the background in an early confrontation scene between Singh and Menon and you know he is trying too hard when the camera isn’t even focused on him) or he is way too dour or he grins too widely and too much. Jacqueline Fernandez is the superhero’s friendly neighbourhood love interest. She has been specialising of late in doing these ditzy-cute roles, I just hope she doesn’t end up doing her masters in them. Menon walks in only to get sidelined by the monster Raaka. Singh is the likeable, spunky, new age filmi mom.Postscript: A Flying Jatt ends with a quote: “Everything has an alternative but not Mother Earth”. Guess who is it from? No, not Rumi, but some Remo. Remo who? The musician? Could it be Remo D’Souza? Surely a first from a director."
	}, {
		"Author": "Hindustan Times",
		"Review": "How do you recognise a desi superhero? He’s the guy whose costume is stitched by his mom. And at some point, he flies to the local sabzi mandi because mom needs lauki. These were my two favourite moments in A Flying Jatt, in which director and co-writer Remo D’Souza presents what is probably the world’s first Sikh superhero in cinema.It’s a terrific idea and who better to play the superhero and his bebe than Tiger Shroff and Amrita Singh. He combines an astonishing agility with a guileless demeanour and is entirely convincing as an invincible do-gooder who saves the world. And she has a defined strength of character, which sadly too few filmmakers have put to good use.A Flying Jatt could have been a fun entertainer with mum as the moral centre. Instead, it is just exhausting.A desi superhero who listens to his mom is a cute idea. It’s the weak plot and absurdly outdated villain that let the film down.Some of the blame can be placed on the oversized shoulders of WWE wrestler Nathan Jones, who plays the baddie Raka. Raka, as the name suggests, is an old-school villain (remember the days when all the villains were called Raka and Teja?). Like those guys, he keeps laughing maniacally. He also spends so much time grunting and growling before he actually attacks that I wondered why his opponents didn’t just run away.Raka is powered by pollution, so the more we pollute, the stronger he gets. Yes, A Flying Jatt is also an eco-fable.The film ends with a quote: “Everything has an alternative. Except Mother Earth.” Who said this? Remo. Be wary of directors who quote themselves. It suggests a singularly unique hubris. Which is also perhaps what allows Remo to borrow liberally from Hollywood franchises like X-Men and Spiderman.The first half of A Flying Jatt has moments of fun — I loved that despite being a superhero he has a fear of heights, so he flies very close to the ground. But post-interval, laughter takes a back seat. The film trips on the feeble love story between the Jatt and Kirti, a giggling schoolteacher, played by Jacqueline Fernandez. I recently interviewed Jacqueline. She said that she was actively scouting for roles with meat. Forget about meat. This character doesn’t even have a skeleton.Jacqueline’s most challenging moment here is an item song called ‘Beat pe booty’, which required her to perform callisthenic dance moves. The only thing I noticed about Kirti was that, when the plot got grim, she started wearing salwar-kameezes instead of Western clothes — adding a touch of gravitas perhaps!There’s also Kay Kay Menon, an otherwise excellent actor, reduced to hamming wildly — while wearing a supremely awkward curly hairdo and shiny plastic ties!Of course, A Flying Jatt doesn’t aim to be anything more than an entertaining cartoon. That’s not a problem. But even cartoons need to be compelling and have a basic coherence. Here the narrative alternates between elaborate fights with tacky digitised backdrops and randomly tacked-on sermons about pollution and even the Sikh faith.At one point Raka growls and declares: “I have a black soul, rooh meri kali hai.” My response — Frankly my dear, I don’t give a damn."
	}]
}, {
	"Name": "Rustom",
	"Data": [{
		"Author": "NDTV",
		"Review": "For Akshay Kumar fans, Rustom is bound to be a full-on treat. The courtroom drama is scripted, crafted and geared to give the lead actor all the space that he needs in order to own the project. The star of the show proves equal to the task. Unfortunately, Rustom, which fictionalizes the sensational true story of naval officer Kawas Manekshaw Nanavati, comes nowhere near becoming an irresistible cinematic account of a murder trial. Written by Vipul K Rawal and directed by Tinu Suresh Desai, Rustom is a strangely bland film that throws more thematic strands into its narrative wicker basket than it can hold - heroism of a man in uniform, marital discord, culpable homicide and legal twists and turns.An apocryphal aircraft carrier scam involving the high and mighty is added to the broth to lend the hero the sheen of a crusader. The first time the audience sees the film's titular figure, he emerges from a naval vessel's engine room and strides out in style to the deck of the ship. There is no way anybody can miss the national flag fluttering in the background. The unblemished character of Commander Rustom Pavri - he is a decorated officer celebrated for his devotion to duty - remains untouched by the complexities of a bitter legal contest or the nuances of a marriage gone sour. Not interested in exploring the frailties that the flesh is heir to, Rustom opts for a facile and melodramatic approach to the 1959 murder case. The handsomely mounted but anodyne film plays out like a straightforward old school good-versus-evil tale in which the truly righteous are allowed a transgression or two in the face of provocation. Every character in the film struts around like a vainglorious clothes horse. Rustom Pavri, the man in the dock, always sports his spotless white naval uniform. Even when he is off duty and in police custody, he is a picture of sartorial poise. His stressed-out wife, despite the serious crisis in her life, is never less than impeccable in her choice of sarees and blouses. The vamp, like all good old vamps, dons western outfits and carries a slender cigarette holder as if it were an extension of her lips, a la Marlene Dietrich. And suave investigating officer Vincent Lobo (Pavan Malhotra, who, as always, makes an impression that rises above the weaknesses of the film) is never caught without his starched buttoned-down shirt, black tie and pleated trousers as he goes about the job of establishing Rustom's guilt. Similarly, the physical spaces that these characters occupy do not have a real, lived-in look. Even the late 1950s Bombay street scenes, well presented as they are, cannot rescue the film from its airy-fairy, disinfected feel. An editor of a tabloid called Truth (played by Kumud Mishra) - the character is obviously modelled on Russi Karanjia of Blitz - is an unflattering caricature of a journalist who gets hauled up on a daily basis by the judge for infringing the law. Outside the sessions court, crowds carry completely-out-of-place placards that read Marry me Rustom, I love you Rustom and I want your baby Rustom. Are we at an IPL match or what? Especially unexceptionable is the way the court scenes are executed. It takes the film away from the reality of the story and delivers an overacted, overstretched passage that overstays its welcome. The public prosecutor (Sachin Khedekar) hectors and hollers his way through the hearing. The judge (Anang Desai) adds to the drama with rather vacuous wisecracks when he is not overruling or sustaining objections. And the jury - the K.M. Nanavati vs. the State of Maharashtra case was India's last such trial by consensus - stands by dutifully until it is time for them to up the ante even further. Everything about Rustom is overly spick and span, which does not allow cinematographer Santhosh Thundiyil to go beyond the standard light-and- shade devices. The kernel of the story: an officer and a gentleman (Akshay Kumar) arrives home after a long absence and stumbles upon an affair that his wife (Ileana D'Cruz) is having with a wealthy social acquaintance of his (Arjun Bajwa). The Navy man loses his cool, confronts the notorious playboy and pumps three bullets into him. All this happens within the first twenty minutes of the film and the rest of Rustom is devoted solely to creating a halo of moral superiority around the killer. The wife, Cynthia, trapped in a bubble of grief and remorse, mopes ceaselessly, shedding copious tears in a bid to wash away her perceived sin. Not for once is the lady allowed to suggest, let alone assert, that what she did outside her marriage might not be the big deal it is made out to be.In one scene, she does declare that I don t care what people think of me. But in another, she, more in line with the moral codes she is forced to subscribe to, admits that she was naive and stupid. Cynthia curses herself for betraying the trust of her husband and stands by him all through the legal process. Nature and fate play a part in Cynthi's dalliance with businessman Vikram Makhija. Her husband is out at sea and the bored wife literally slips in the rain and sprains her ankle. Vikram, at hand to provide solace, exploits her vulnerability and the rest is inevitable. The weakest part of Rustom is the manner in which the character of businessman Vikram Makhija is sketched out - as a scheming womanizer who is helped along by 'evil' sister Priti (Esha Gupta).There is little room in this construct for a layered investigation of motives and impulses. Everything is spelled out in black and white in the course of the protracted court proceedings in which the lawyer of the deceased's sister loses no opportunity to be scurrilous. Defending himself - he refuses the services of a professional counsel - Rustom faces the allegations and insinuations without batting an eyelid.Akshay's cool, calm, composed avatar is bound to floor many, and not just his ardent fans. There is little in this film that could displease the actor's constituency. Rustom is largely inoffensive, even passable in the main, but could have been infinitely better had the screenplay not been so utterly conventional and unimaginative."
	}, {
		"Author": "The Hindu",
		"Review": "You smell a rat right away. It’s at the entry of the naval officer hero Rustom Pavri (Akshay Kumar) framed against the tricolour fluttering away in the background. Director Tinu Suresh Desai reinterprets the (in)famous K.M. Nanavati case of yore and builds a popular conspiracy theory around it in the spirit of today’s uber-patriotic times, quite conveniently at that. Kumar, plays the Nanavati figure while Ileana D’ Cruz is Cynthia (the philandering Sylvia from real life) and Arjun Bajwa plays Vikram Makhija (the playboy Prem Ahuja).Kuchh to hai jo pakad mein nahin aa raha hai (There is something that one is unable to figure out),” says the investigating cop Vincent Lobo (Pavan Malhotra) at some point. However, any marginally intelligent viewer would know where things are heading. Even though, the film itself very consciously tries to make a big deal of how much more there is to this seemingly simple, open and shut case of betrayal, jealousy and revenge.Forget that there is nothing remotely credible or engaging in the thriller. The film, in fact, feels like a parody of the several murder mysteries and court room dramas we have seen down the ages. And an unintentionally funny one at that. Some moments in the second half are truly priceless, especially those that are to do with an orange dressing gown and a precariously held white towel that refuses to slip down the waist.But, what is more irritating is the righteousness attributed to the killer protagonist – a virtuous Kumar, right down to the sanctimonious moustache and straight spine; then the overt guilt, perennially inclined head of Ileana and the talk of putting the Queen at stake in the game of chess, all for an eventual win. Add to that the “desh ki raksha/hifazat” angle and the double whammy of machismo of the Navy man—in the aid of the nation and the woman—and it gets way too smug for comfort. Kumar wrests the moral high ground, as a man, a husband and a much decorated officer. And the janta approves.There is the constant harping on doing the right thing the wrong way. It all comes down to a combat situation, self defence, reflex action and ‘civilians ka vishwas’. Eventually, a kangaroo court comes to the rescue but not before turning the film into utter hotchpotch of a narrative.In just a few scenes there is the fleeting mention of friction between the Sindhi community to which the victim belongs and the Parsis and you wonder if the film is trying to chart out an interesting, provocative terrain. But it never becomes anything more than a mere mention. Add to that, some strident, ominous music that keeps playing in the background to keep up the tension and anxiety when there is actually none.D’ Cruz seems to be suffering from a bad case of makeup with the shade of pink leaking all over the face. Or is it the colour of shame? The characters on the side are rendered caricature like, defined by quirks. So you have Pavan Malhotra as the cop Vincent Lobo with his high-waisted trousers and irritating habit of clicking away the ballpen. Then there is Anang Desai as the judge who acts like a school principal. Desai looks as if he veered into the courtroom straight from the sets of the TV serial Khichdi where he played the irritable patriarch. Esha Gupta with her cigarette holders, gowns and perennially sour look is so assembled that she just seems to fall apart. And Sachin Khedekar goes on an acting overdrive as the prosecuting lawyer.The period recreation of 1959 Bombay feels like a tacky, bad copy of the city that Anurag Kashyap’s Bombay Velvet created. Each frame screams retro, wants you to notice the bouffant hair, the satin gowns, the vintage cars and radio sets.In fact, I wondered if it wouldn't have been better for the film to have been updated for contemporary times. A case in point being, the tabloid frenzy and trial by media unspooled by Rusi Karanjia's Blitz (Kumud Mishra as Eruch Billimoria) in the film versus the present where – things are much more in your face. Also, stealthy affairs of the heart could have had an added edge of complication in the mobile phone dominated times that we live in."
	}, {
		"Author": "Hindustan Times",
		"Review": "A naval officer kills his wife’s boyfriend and pleads not guilty. The jury weighs its options and declares it an accidental death. The decorated navy commander walks scot-free.But there’s more to the case than what meets the eyes. The only person who knows what exactly is the missing link is Rustom Pavri, the accused standing in the witness box.And that is the clincher in the film that spins off on the sensational KM Nanavati case that caught national attention in 1959.Rustom (Akshay Kumar) can’t keep his hands off his wife Cynthia (Ileana D’Cruz), but work commitments send him on a six month trip. The tour finishes before time, and Rustom returns to find Cynthia in the arms of a hot-headed millionaire, Vikram Makhija (Arjan Bajwa).Akshay Kumar has aced the art of presenting thrillers with patriotic tone. (Twitter)Rustom’s raging anger knows no bounds, and Vikram is killed. The officer decides to fight his own case, and cleverly places his pawns. The local media shows tremendous interest in his personality. But there’s still a long way before he can present the case as a crime of passion instead of cold-blooded murder.This case is to be judged by a jury that comprises of local dignitaries. The society’s idea of infidelity and consenting adults are likely to impact the final outcome.It’s early 1960s and the Indian navy is making its presence felt in the Arabian Sea. Men in uniform command respect, and envy. Added to that, Rustom is from an affluent class in an economically struggling country.Though part of the story is based on fact, it’s the relationship drama that actually makes this a thriller. It’s a juicy retro story given more panache with a voiceover by Manoj Bajpayee, who introduces us to Mumbai’s Queen’s Necklace in sepia.The premise is fairly simple. Director Tinu Desai’s characters reveal themselves rather obviously: A heartbroken naval officer, his cheating wife, the Casanova lover, his evil sister, sympathetic cops, an ambitious reporter and an overtly confused jury. But, slowly and surely, the movie grips you.Now, Akshay Kumar is playing to the gallery here. But, he gives a fine touch to Rustom Pavri. More on the lines of Special 26 than Airlift or Baby, Kumar tones it down to suit the character. Sharp, deceptive and likeable. Most of the scenes are planned around him at the helm, and it’s a wise move, for he knows how to keep the tempo.What also works is the courtroom drama. Desai takes her time with it -- almost the entire second half of the movie. The cross examination is teased into the script, and actors Kumud Mishra, Sachin Khedekar, Pawan Malhotra and Anang Desai keep you hooked through it.But not everything in Rustom is proportioned right. Lousy special effects and the language of certain characters are a few things that warp the authentic feel of the movie. Yet, somehow Rustom doesn’t falter, except when you realise the movie two and a half hours long."
	}]
}]